app/views/shared/_likes.html.erb


 <%= tweet.likes.count %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."tweet_id" = ?  [["tweet_id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."tweet_id" = ?  [["tweet_id", 2]]