app/controllers/likes_controller.rb

INSERT INTO "likes" ("tweet_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tweet_id", 1], ["user_id", 2], ["created_at", "2016-05-25 23:41:20.538423"], ["updated_at", "2016-05-25 23:41:20.538423"]]
SELECT  "likes".* FROM "likes" WHERE "likes"."tweet_id" = ? AND "likes"."user_id" = ?  ORDER BY "likes"."id" ASC LIMIT 1  [["tweet_id", 1], ["user_id", 2]]
---
  def create
    @tweet.likes.where(user_id: current_user.id).first_or_create

DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."tweet_id" = ? AND "likes"."user_id" = ?  [["tweet_id", 2], ["user_id", 2]]
---
  def destroy
    @tweet.likes.where(user_id: current_user.id).destroy_all

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_tweet
      @tweet = Tweet.find(params[:tweet_id])