app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "Hello out there!"], ["user_id", 1], ["created_at", "2016-05-23 22:30:45.039071"], ["updated_at", "2016-05-23 22:30:45.039071"]]
---
  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save